tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "heroku/brew"
tap "remotemobprogramming/brew"
tap "versent/homebrew-taps"

# CLI tool for working with Architecture Decision Records
brew "adr-tools"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Safely store secrets in Git/Mercurial/Subversion
brew "blackbox"

# Enables you to reproduce the CircleCI environment locally
brew "circleci"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Distributed revision control system
brew "git"

# GitHub command-line tool
brew "gh"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# Improved top (interactive process viewer)
brew "htop"

# Add GitHub support to git on the command-line
brew "hub"

# Command-line collection runner for Postman
brew "newman"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"

# Framework for layout and rendering of i18n text
brew "pango"

# CLI tool which enables you to login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"

# Cross-shell prompt for astronauts
brew "starship"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"

# Simplified and community-driven man pages
brew "tldr"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Homebrew, but with Docker images
brew "whalebrew"

# Terraform Language Server
brew "hashicorp/tap/terraform-ls"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and
# creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"

cask "adoptopenjdk11-jre" # AdoptOpenJDK OpenJDK (Java) Development Kit
cask "camo-studio" # Use your phone as a high-quality webcam with image tuning controls
cask "chromium" # Free and open-source web browser
cask "dash" # API documentation browser and code snippet manager
cask "docker" # App to build and share containerized applications and microservices
cask "discord" # Voice and text chat software
cask "drawio" # Draw.io is free online diagram software
cask "emacs" # Text editor
cask "figma"
cask "firefox-developer-edition" # Web browser
cask "font-jetbrains-mono" # Typeface made for developers
cask "font-juliamono" # Monospaced typeface designed for programming in Julia
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
cask "gpg-suite" # Tools to protect your emails and files
cask "jetbrains-toolbox" # JetBrains tools manager
cask "keybase" # End-to-end encryption software
cask "miro"
cask "nosql-workbench" # Client-side GUI application for modern database development and operations
cask "notion" # App to write, plan, collaborate, and get organized
cask "pluralsight"
cask "pop" # Remote pair programming
cask "postman" # Collaboration platform for API development
cask "powershell" # Command-line shell and scripting language
cask "sketch" # Digital design and prototyping platform
cask "visual-studio-code" # Open-source code editor

mas "Jira", id: 1475897096
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

whalebrew "whalebrew/imagemagick"
whalebrew "whalebrew/jq"
whalebrew "whalebrew/plantuml"
whalebrew "whalebrew/yq"
