tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Distributed revision control system
brew "git"

# Improved top (interactive process viewer)
brew "htop"

# Add GitHub support to git on the command-line
brew "hub"

# Mac App Store command-line interface
brew "mas"

# The cross-shell prompt for astronauts
brew "starship"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Tool to build, change, and version infrastructure
brew "terraform"

# Simplified and community-driven man pages
brew "tldr"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Homebrew, but with Docker images
brew "whalebrew"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

cask "1password"
cask "3dconnexion"
cask "aerial"
cask "alfred"
cask "autodesk-fusion360"
cask "backblaze"
cask "dash"
cask "docker"
cask "dymo-label"
cask "figma"
cask "firefox-developer-edition"
cask "folding-at-home"
cask "font-jetbrains-mono"
cask "fujitsu-scansnap-home"
cask "garmin-express"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "grammarly"
cask "hey"
cask "jabra-direct"
cask "jetbrains-toolbox"
cask "keybase"
cask "logitech-camera-settings"
cask "logitech-options"
cask "notion"
cask "postman"
cask "sizeup"
cask "sketch"
cask "sketchup-pro"
cask "skype"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"

mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Post-it®", id: 1475777828
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Wallcat", id: 1000397973
mas "Xcode", id: 497799835

whalebrew "whalebrew/imagemagick"
whalebrew "whalebrew/jq"
whalebrew "whalebrew/packer"
whalebrew "whalebrew/plantuml"
whalebrew "whalebrew/yq"
