tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "adoptopenjdk/openjdk"
tap "cantino/mcfly"
tap "clementtsang/bottom"
tap "hashicorp/tap"
tap "heroku/brew"
tap "remotemobprogramming/brew"
tap "versent/homebrew-taps"

# 1Password CLI
brew "1password-cli"

# CLI tool for working with Architecture Decision Records
brew "adr-tools"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Container runtimes on MacOS with minimal setup
brew "colima"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Isolated development environments using Docker
brew "docker-compose"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Distributed revision control system
brew "git"

# GitHub command-line tool
brew "gh"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Add GitHub support to git on the command-line
brew "hub"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Draw UML diagrams
brew "plantuml"

# Cross-shell prompt for astronauts
brew "starship"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Command-line utility for Structurizr
brew "structurizr-cli"

# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"

# Process YAML documents from the CLI
brew "yq"

# Terraform Language Server
brew "hashicorp/tap/terraform-ls"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and
# creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"

cask "adoptopenjdk11-jre" # AdoptOpenJDK OpenJDK (Java) Development Kit
cask "camo-studio" # Use your phone as a high-quality webcam with image tuning controls
cask "chromium" # Free and open-source web browser
cask "discord" # Voice and text chat software
cask "emacs" # Text editor
cask "figma"
cask "firefox-developer-edition" # Web browser
cask "font-jetbrains-mono" # Typeface made for developers
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
cask "gpg-suite" # Tools to protect your emails and files
cask "jetbrains-toolbox" # JetBrains tools manager
cask "loom" # Screen and video recording software
cask "miro" # Online collaborative whiteboard platform
cask "nosql-workbench" # Client-side GUI application for modern database development and operations
cask "notion" # App to write, plan, collaborate, and get organized
cask "postman" # Collaboration platform for API development
cask "sketch" # Digital design and prototyping platform
cask "teamviewer" # Remote access software
cask "visual-studio-code" # Open-source code editor
cask "yubico-yubikey-manager" # YubiKey Manager is a cross-platform application for configuring your YubiKey

mas "Jira", id: 1475897096
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
