tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"

# Mac App Store command-line interface
brew "mas"

cask "3dconnexion"
cask "autodesk-fusion360"
cask "backblaze"
cask "dymo-label"
cask "folding-at-home"
cask "fujitsu-scansnap-home"
cask "garmin-express"
cask "grammarly"
cask "hey"
cask "jabra-direct"
cask "kindle"
cask "sketchup-pro"
cask "whatsapp"

mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Post-it®", id: 1475777828
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Wallcat", id: 1000397973
mas "Xcode", id: 497799835
