tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"

# Distributed revision control system
brew "git"

# Add GitHub support to git on the command-line
brew "hub"

# Mac App Store command-line interface
brew "mas"

# The cross-shell prompt for astronauts
brew "starship"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

cask "aerial"
cask "alfred"
cask "autodesk-fusion360"
cask "backblaze"
cask "docker"
cask "dymo-label"
cask "figma"
cask "firefox-developer-edition"
cask "gpg-suite"
cask "keybase"
cask "postman"
cask "skype"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"

mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Post-it®", id: 1475777828
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Wallcat", id: 1000397973
mas "Xcode", id: 497799835
