cask_args appdir: '/Applications'

tap 'caskroom/homebrew-fonts'
tap 'caskroom/homebrew-versions'
tap 'homebrew/services'
tap 'puma/puma'
tap 'thoughtbot/formulae'

# Shell
brew 'fish' # user-friendly command-line shell
brew 'gitsh' # an interactive shell for Git

# Unix tools
brew 'ack' # for finding things in files
brew 'archey' # for displaying system information
brew 'aspell' # for  spell checking
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'direnv' # environment switcher for the shell
brew 'gawk' # for better UTF-8 character support
brew 'git' # for version control
brew 'git-lfs' # for version control of large files
brew 'gnupg' # for encryption and signing of data and communications
brew 'gpg-agent' # GPG key agent
brew 'grc' # for colorising logfiles and command output
brew 'httpie' # CLI HTTP client
brew 'jq' # for command-line JSON processing
brew 'keybase' # command-line interface to Keybase.io
brew 'nginx' # HTTP server and reverse proxy
brew 'openconnect' # VPN client for Cisco's AnyConnect VPN
brew 'openssl' # for Transport Layer Security (TLS)
brew 'pinentry' # passphrase entry dialog
brew 'pinentry-mac' # pinentry for GPG on Mac
brew 'puma-dev' # to manage rack apps in development with puma
brew 'rcm' # for managing dotfiles
brew 'tmux' # for saving project state and switching between projects
brew 'zopfli' # very good, but slow, deflate or zlib compression

# AWS tools
brew 'awscli' # official AWS command-line interface

# Digital Ocean tools
brew 'doctl' # a command line tool for DigitalOcean services

# GitHub tools
brew 'hub' # for interacting with the GitHub API

# HashiCorp tools
brew 'consul' # service discovery and configuration
brew 'nomad' # deploy applications
brew 'packer' # create images for the cloud
brew 'serf' # cluster membership, failure detection and orchestration
brew 'terraform' # manage cloud infrastructure
cask 'vagrant' # manage development environments
brew 'vault' # manage secrets

# Heroku tools
brew 'heroku-toolbelt' # everything needed to get started with Heroku

# Image tools
brew 'imagemagick' # for cropping and resizing images

# Programming languages and configuration
brew 'elixir' # for a Elixir programming environment
brew 'erlang' # for a Erlang programming environment
brew 'go' # for a Go programming environment
brew 'node-build' # for installing Node.js
brew 'nodeenv' # for managing versions of Node.js
brew 'python' # for a Python programming environment
brew 'rbenv' # for managing versions of Ruby
brew 'rbenv-aliases' # for creating aliases for versions of Ruby
brew 'rbenv-default-gems' # for installing default gems with version of Ruby
brew 'ruby-build' # for installing Rubies

# Testing tools
brew 'phantomjs' # for headless WebKit scriptable testing via a JavaScript API
brew 'qt' # for headless JavaScript testing via Capybara Webkit

# Applications
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'datagrip'
cask 'dymo-label'
cask 'flux'
cask 'garmin-express'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gpgtools'
cask 'imagealpha'
cask 'imageoptim'
cask 'intellij-idea'
cask 'ipvanish-vpn'
cask 'iterm2'
cask 'kaleidoscope'
cask 'kindle'
cask 'kitematic'
cask 'logitech-myharmony'
cask 'paparazzi'
cask 'safari-technology-preview'
cask 'screenhero'
cask 'skype'
cask 'telegram'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'whatsapp'

# Databases
brew 'mysql', restart_service: :changed
brew 'postgresql', restart_service: :changed
brew 'redis', restart_service: :changed
brew 'sqlite'

# Editors
brew 'emacs-mac', args: %w(with-spacemacs-icon)

# Fonts
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fontawesome'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
