# coding: utf-8
cask_args appdir: '/Applications'

tap 'homebrew/cask-drivers' # Casks of drivers
tap 'homebrew/cask-fonts' # Casks of fonts
tap 'homebrew/cask-versions' # Alternate versions of Casks
tap 'homebrew/command-not-found' # Reproduces Ubuntu’s command-not-found

tap 'cloudfoundry/tap'
tap 'heroku/brew'
tap 'puma/puma'
tap 'thoughtbot/formulae'

# Shell
brew 'fish' # User-friendly command-line shell for UNIX-like operating systems

# Unix tools
brew 'ack' # Search tool like grep, but optimized for programmers
brew 'ansible' # Automate deployment, configuration, and upgrading
brew 'ansifilter' # Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew 'archey' # Graphical system information display for macOS
brew 'aspell' # Spell checker with better logic than ispell
brew 'blackbox' # Safely store secrets in Git/Mercurial/Subversion
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'direnv' # Load/unload environment variables based on $PWD
brew 'fpp' # CLI program that accepts piped input and presents files for selection
brew 'gawk' # GNU awk utility
brew 'git' # Distributed revision control system
brew 'git-fresh' # Utility to keep git repos fresh
brew 'git-lfs' # Git extension for versioning large files
brew 'gnupg' # GNU Pretty Good Privacy (PGP) package
brew 'gpg-agent' # GPG key agent
brew 'grc' # Colorise logfiles and command output
brew 'httpie' # User-friendly cURL replacement (command-line HTTP client)
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'mas' # Mac App Store command-line interface
brew 'openconnect' # Open client for Cisco AnyConnect VPN
brew 'parallel' # Shell command parallelisation utility
brew 'pass' # Password manager
brew 'pinentry' # Passphrase entry dialog utilizing the Assuan protocol
brew 'pinentry-mac' # Pinentry for GPG on Mac
brew 'puma/puma/puma-dev' # A tool to manage rack apps in development with puma
brew 'reattach-to-user-namespace' # Reattach process (e.g., tmux) to background
brew 'thoughtbot/formulae/rcm' # Management suite for dotfiles
brew 'tmux' # Terminal multiplexer
brew 'wget' # Internet file retriever
brew 'zopfli' # New zlib (gzip, deflate) compatible compressor

# Libraries
brew 'libyaml' # YAML Parser
brew 'openssl' # SSL/TLS cryptography library

# Command-line interfaces
brew 'awscli' # Official Amazon AWS command-line interface
brew 'cloudfoundry/tap/cf-cli' # Official Cloud Foundry command-line interface
brew 'doctl' # Command-line tool for DigitalOcean
brew 'heroku/brew/heroku' # Everything you need to get started with Heroku
brew 'hub' # Add GitHub support to git on the command-line

# Docker
cask 'docker' # Docker for macOS

# Image tools
brew 'imagemagick' # Tools and libraries to manipulate images in many formats

# macOS App Store
mas '1Password 7', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'Fusion360', id: 868968810
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Noizio', id: 928871589
mas 'OmniGraffle', id: 711830901
mas 'Parcel', id: 639968404
mas 'Shopify', id: 1208212036
mas 'Slack', id: 803453959
mas 'StuffIt Expander', id: 919269455
mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 1384080005
mas 'Wallcat', id: 1000397973
mas 'WinZip', id: 583827028

# Programming languages, configuration and infrastructure
brew 'elasticsearch' # Distributed search & analytics engine
brew 'elixir' # Functional metaprogramming aware language built on Erlang VM
brew 'erlang' # for a Erlang programming environment
brew 'go' # Open source programming language to build simple/reliable/efficient software
cask 'java8' # for Java 8
brew 'kibana' # Analytics and search dashboard for Elasticsearch
brew 'node-build' # Install NodeJS versions
brew 'nodeenv' # Manage multiple NodeJS versions
brew 'postgis' # Adds support for geographic objects to PostgreSQL
brew 'postgresql' # Object-relational database system
brew 'pyenv' # Python version management
brew 'pyenv-virtualenv' # Pyenv plugin to manage virtualenv
brew 'python@2' # for a Python 2 programming environment
brew 'python@3' # for a Python 3 programming environment
brew 'rbenv' # Ruby version manager
brew 'rbenv-aliases' # Make aliases for Ruby versions
brew 'rbenv-default-gems' # Auto-installs gems for Ruby installs
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'ruby-build' # for installing Rubies
brew 'sqlite' # Command-line interface for SQLite
brew 'yarn' # JavaScript package manager

# Testing tools
brew 'chromedriver' # Tool for automated testing of webapps across many browsers
brew 'phantomjs' # Headless WebKit scriptable with a JavaScript API
brew 'qt' # Cross-platform application and UI framework

# Applications
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'backblaze'
cask 'bartender'
cask 'dymo-label'
cask 'emacs'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'imagealpha'
cask 'imageoptim'
cask 'ipvanish-vpn'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keybase'
cask 'paparazzi'
cask 'plex-media-server'
cask 'postman'
cask 'rowanj-gitx'
cask 'safari-technology-preview'
cask 'sizeup'
cask 'skype'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Drivers
cask 'garmin-express'
cask 'logitech-myharmony'

# Fonts
cask 'font-jetbrains-mono'
