cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'puma/puma'
tap 'thoughtbot/formulae'

# Shell
brew 'fish' # user-friendly command-line shell
brew 'gitsh' # an interactive shell for Git

# Unix tools
brew 'ack' # for finding things in files
brew 'archey' # for displaying system information
brew 'aspell' # for  spell checking
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'direnv' # environment switcher for the shell
brew 'fpp' # for selecting files out of bash output
brew 'gawk' # for better UTF-8 character support
brew 'git' # for version control
brew 'git-lfs' # for version control of large files
brew 'gnupg' # for encryption and signing of data and communications
brew 'gpg-agent' # GPG key agent
brew 'grc' # for colorising logfiles and command output
brew 'httpie' # CLI HTTP client
brew 'jq' # for command-line JSON processing
brew 'keybase' # command-line interface to Keybase.io
brew 'nginx' # HTTP server and reverse proxy
brew 'openconnect' # VPN client for Cisco's AnyConnect VPN
brew 'openssl' # for Transport Layer Security (TLS)
brew 'pinentry' # passphrase entry dialog
brew 'pinentry-mac' # pinentry for GPG on Mac
brew 'puma-dev' # to manage rack apps in development with puma
brew 'rcm' # for managing dotfiles
brew 'thefuck' # corrects a previous console command
brew 'tmux' # for saving project state and switching between projects
brew 'zopfli' # very good, but slow, deflate or zlib compression

# AWS tools
brew 'awscli' # official AWS command-line interface

# Digital Ocean tools
brew 'doctl' # a command line tool for DigitalOcean services

# Docker
cask 'docker' # Docker for macOS
cask 'kitematic' # visual Docker container management for macOS

# GitHub tools
brew 'hub' # for interacting with the GitHub API

# HashiCorp tools
brew 'consul' # service discovery and configuration
brew 'nomad' # deploy applications
brew 'packer' # create images for the cloud
brew 'serf' # cluster membership, failure detection and orchestration
brew 'terraform' # manage cloud infrastructure
cask 'vagrant' # manage development environments
brew 'vault' # manage secrets

# Heroku tools
brew 'heroku' # everything needed to get started with Heroku

# Image tools
brew 'imagemagick' # for cropping and resizing images

# macOS App Store
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'Deckset', id: 847496013
mas 'iA Writer', id: 775737590
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Noizio', id: 928871589
mas 'Numbers', id: 409203825
mas 'OmniGraffle', id: 711830901
mas 'Pages', id: 409201541
mas 'Scapple', id: 568020055
mas 'Slack', id: 803453959
mas 'StuffIt Expander', id: 919269455
mas 'Telegram', id: 747648890
mas 'Tweetbot', id: 557168941
mas 'Wallcat', id: 1000397973
mas 'WinZip', id: 583827028

# Programming languages and configuration
brew 'elixir' # for a Elixir programming environment
brew 'erlang' # for a Erlang programming environment
brew 'go' # for a Go programming environment
brew 'node-build' # for installing Node.js
brew 'nodeenv' # for managing versions of Node.js
brew 'pyenv' # for managing versions of Python
brew 'pyenv-virtualenv' # Pyenv plugin to manage virtualenv
brew 'python' # for a Python programming environment
brew 'rbenv' # for managing versions of Ruby
brew 'rbenv-aliases' # for creating aliases for versions of Ruby
brew 'rbenv-default-gems' # for installing default gems with version of Ruby
brew 'ruby-build' # for installing Rubies
brew 'yarn' # fast, reliable, and secure dependency management for JavaScript

# Testing tools
brew 'casperjs' # navigation scripting and testing utility for PhantomJS
brew 'phantomjs' # for headless WebKit scriptable testing via a JavaScript API
brew 'qt' # for headless JavaScript testing via Capybara Webkit

# Applications
cask 'adobe-creative-cloud'
cask 'aerial'
cask 'appcleaner'
cask 'backblaze'
cask 'bartender'
cask 'dash'
cask 'dymo-label'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gpgtools'
cask 'imagealpha'
cask 'imageoptim'
cask 'ipvanish-vpn'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'microsoft-office'
cask 'mongodb-compass'
cask 'paparazzi'
cask 'safari-technology-preview'
cask 'screenhero'
cask 'sizeup'
cask 'skype'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'whatsapp'

# Drivers
cask 'garmin-express'
cask 'logitech-myharmony'

# Editors
brew 'emacs', args: %w(with-cocoa)

# Fonts
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fontawesome'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
